/*A. Cтек
time limit per test1 second
memory limit per test256 megabytes
Сіз C++ тілінің жаңадан келген бағдарламашысы екеніңізді елестетіп көріңіз және сіздің міндетіңіз кітаптарды соңғы кірген, бірінші шығатын принцип бойынша жинақталатын шағын кітапханадағы кітаптарды басқаруға арналған шағын бағдарламаны әзірлеу болып табылады. Бағдарлама стек деректер құрылымы негізінде жүзеге асырылады және кітапхана әкімшісіне кітаптарды тиімді басқаруға көмектеседі.

Команды:

push n — стектің жоғарғы жағына бірегей n нөмірі бар кітапты қосыңыз. Бағдарлама «ok» деп шығуы керек.
pop — соңғы қосылған кітапты жойып, оның нөмірін көрсетіңіз.
back — соңғы қосылған кітаптың нөмірін жоймай-ақ көрсетіңіз.
size — стектегі кітаптардың санын көрсетіңіз.
clear — барлық кітаптар жинағын тазалаңыз («ok» басып шығарыңыз).
exit — бағдарламаны аяқтаңыз, «bye» деп басып шығарыңыз.
Input
Стек басқару пәрмендері бұрын сипатталған пішімде енгізіледі, әр жолға 1.

Енгізу пәрмендерінің жиыны келесі талаптарды қанағаттандыратынына кепілдік беріледі: кез келген уақытта стекте элементтердің максималды саны 100-ден аспайды, барлық pop және back командалары дұрыс, яғни олар орындалған кезде стек мынаны қамтиды: кем дегенде бір элемент.

Output
Стекпен жұмыс істеу протоколын көрсету қажет, әр жолға 1 хабарлама.

Example
InputCopy
push 3
push 14
size
clear
push 1
back
push 2
back
pop
size
pop
size
exit
OutputCopy
ok
ok
2
ok
ok
1
ok
2
2
1
1
0
bye*/
#include<bits/stdc++.h>
using namespace std;
int main(){
    stack<int> s;
    string str;
    while(cin>>str){
        if(str=="push"){
            int n;
            cin>>n;
            s.push(n);
            cout<<"ok"<<endl;
        }
        else if(str=="pop"){
            cout<<s.top()<<endl;
            s.pop();
        }
        else if(str=="back"){
            cout<<s.top()<<endl;
        }
        else if(str=="size"){
            cout<<s.size()<<endl;
        }
        else if(str=="clear"){
            while(!s.empty()){
                s.pop();
            }
            cout<<"ok"<<endl;
        }
        else if(str=="exit"){
            cout<<"bye"<<endl;
            break;
        }
    }
    return 0;
}