/*D. Өзгеше сұрыптау-1
time limit per test1 second
memory limit per test256 megabytes
n
 бүтін сандардан тұратын a
 массиві берілген. Массивті элементтер цифрларының қосындысы бойынша өсу ретімен сұрыптаңыз. Егер кейбір элементтерде цифрларының қосындылары бірдей болса, онда оларды элементтерінің мәні бойынша сұрыптау керек.

Input
Кіріс деректерінің бірінші жолында бір бүтін сан бар – n
 (1≤n≤2∗105)
 - массивтегі элементтер саны.

Келесі жолда n
 бүтін сан бос орын арқылы жазылады - массив элементтері.

Output
Бос орын арқылы бір жолда сұрыпталған массивті шығарыңыз.

Examples
InputCopy
7
191 9999 92 18 9 12 21
OutputCopy
12 21 9 18 92 191 9999 
InputCopy
3
1000000000 999999999 999999998
OutputCopy
1000000000 999999998 999999999 

*/
#include<bits/stdc++.h>
using namespace std;
int main(){
    int n;
    cin>>n;
    vector<string> v(n);
    for(int i=0;i<n;i++){
        cin>>v[i];
    }
    sort(v.begin(),v.end(),[](string a,string b){
        return a+b<b+a;
    });
    for(int i=0;i<n;i++){
        cout<<v[i]<<" ";
    }
    return 0;
}