/*C. Батыр
time limit per test1 second
memory limit per test256 megabytes
Аспандағы Асгард қаласында адамдар қорқынышта отыр, өйткені n
 құбыжықтар сол жаққа қарай бет алады. Тұрғындардың соңғы үміті — Тор.

Тордың күші x
-қа, ал i−
ыншы құбыжықтың күші ai
-ға тең. Тор i
 нөмірлі құбыжықты, оның күші құбыжықтың күшінен көп болған жағдайда ғана өлтіре алады, яғни x>ai
. Егер Тор i−
ыншы құбыжықты өлтірсе, оның күші ai
-ға артады. Торға мүмкіндігінше көп күш алуға және ол өлтіре алатын құбыжықтардың максималды санын шығаруға көмектесіңіз.

Input
Кіріс деректерінің бірінші жолында екі бүтін сан n
 және x
 (3≤n≤105,1≤x≤109)
 берілген.

Кіріс деректерінің екінші жолында n
 бүтін сан a1,a2,...,an
 (1≤ai≤109)
 берілген.

Output
Шығыс деректеріне бір ғана бүтін санды — Тор өлтіре алатын құбыжықтардың ең көп санын шығарыңыз.

Example
InputCopy
5 3
1 4 16 12 3
OutputCopy
3
Note
Бірінші мысалда Тор мына ретпен өлтіре алады: (1,5,2)
, яғни келесі қуаттармен: (1,3,4)
.


*/
#include<bits/stdc++.h>
using namespace std;
int main(){
    int n,x;
    cin>>n>>x;
    vector<int> a(n);
    for(int i=0;i<n;++i){
        cin>>a[i];
    }
    sort(a.begin(),a.end());
    int count=0;
    for(int i=0;i<n;++i){
        if(x>a[i]){
            x+=a[i];
            count++;
        }
        else if(x==a[i]){
            x+=a[i];
            count++;
        }
        else{
            break;
        }
    }
    cout<<count<<endl;
    return 0;
}