/*B. Сұрыпталған индекстер
time limit per test1 second
memory limit per test256 megabytes
n
 бүтін сандардан тұратын a
 массиві берілген. Массивті кемімейтін ретпен сұрыптаңыз және сұрыпталған массивтің бастапқы индекстерін басып шығарыңыз.

Input
Кіріс деректерінің бірінші жолында бір бүтін сан n
 (3≤n≤105)
 берілген.

Кіріс деректерінің екінші жолында n
 бүтін сан a1,a2,...,an
 (1≤ai≤109)
 берілген.

Output
Шығыс деректеріне бос орындар(пробел) арқылы массивтің элементтерінің бастапқы индекстерін шығарыңыз.

Example
InputCopy
4
7 9 8 6
OutputCopy
4 1 3 2 
Note
Бірінші мысалда массивді сұрыптасаңыз, сіз [6,7,8,9]
 аласыз және олардың бастапқы индекстері [4,1,3,2]
 болады.


*/
#include<bits/stdc++.h>
using namespace std;
int main(){
    int n;
    cin>>n;
    vector<pair<int,int>> a(n);
    for(int i=0;i<n;i++){
        cin>>a[i].first;
        a[i].second=i;
    }
    sort(a.begin(),a.end());
    for(int i=0;i<n;i++){
        cout<<a[i].second+1<<" ";
    }
    return 0;
}