/*A. Команда
time limit per test1 second
memory limit per test256 megabytes
Дарынды балаларға арналған мектепте бағдарламалаудан n
 олимпиадашы бар. i
 нөмірлі оқушының рейтингі ai
-ға тең. Жақында бағдарламалау бойынша халықаралық командалық олимпиада өтеді. Команданың сәтсіздігі - максималды және минималды рейтингі бар оқушылар арасындағы айырмашылық. Топтың сәтсіздігі минималды болу үшін, мектеп директорына үш оқушыдан тұратын бір команда жинауға көмектесіңіз. Мүмкін болатын команданың ең минималды сәтсіздігін табыңыз.

Input
Кіріс деректерінің бірінші жолында бір бүтін сан n
 (3≤n≤105)
 берілген.

Кіріс деректерінің екінші жолында n
 бүтін сан a1,a2,...,an
 (1≤ai≤109)
 берілген.

Output
Шығыс деректеріне бір ғана бүтін санды — мүмкін болатын команданың ең минималды сәтсіздігін шығарыңыз.

Example
InputCopy
6
1 13 12 4 8 9
OutputCopy
4
Note
Бірінші мысалда (13,12,9)
 ала аламыз, сәтсіздік 4
 болады.


*/
#include<bits/stdc++.h>
using namespace std;
int main(){
    int n;
    cin>>n;
    vector<int> a(n);
    for(int i=0;i<n;i++){
        cin>>a[i];
    }
    sort(a.begin(),a.end());
    int min=INT_MAX;
    for(int i=0;i<=n-3;++i){
        int current=a[i+2]-a[i];
        if(current<min){
            min=current;
        }
    }
    cout<<min<<endl;
    return 0;
}